[
  {
    "id": "epam",
    "companyType": "Outsourcing company",
    "label": "EPAM Systems",
    "date": "Jan 2022 - Feb 2023",
    "image": "/companies/epam.png",
    "cutImage": false,
    "position": "Frontend developer (React)",
    "description": [
      "As a Frontend Developer, I developed an e-commerce platform using the React Hydrogen framework.",
      "Being one of the 4 JS engineers on our project, I took responsibility for handling complex and business-critical tasks (new features, supporting existing functionality, SPA SEO optimization)",
      "Personally developed key features such as the shopping cart, product showcase, store search, and the homepage.",
      "I also refactored legacy code, resulting in a 30% reduction in overall code size.",
      "Worked closely with a UI/UX designer to improve the internal library of UI components.",
      "Additionally, I successfully negotiated with the client to enhance the project and delivered results within sprints.",
      "Reduced project bundle size, refactored legacy code, and optimized application performance.",
      "Participated in conducting code reviews and providing feedback to project colleagues, contributing to improved code quality and team collaboration.",
      "Implemented optimal caching methods and lazy loading to speed up page load times and improve user experience.",
      "Developed project documentation and trained new team members, helping them quickly understand the project and start actively interacting with colleagues."
    ]
  },
  {
    "id": "buisness-network",
    "companyType": "Telecommunication company",
    "label": "Business network",
    "date": "Jun 2021 - Jan 2022",
    "image": "/companies/buisness-network.jpg",
    "cutImage": true,
    "position": "Frontend developer (Vue)",
    "description": [
      "Collaborated on the development of platform bn.by",
      "Enhanced the platform's search functionality by implementing advanced filtering options, improving the user experience and increasing the efficiency of search queries",
      "Developed and integrated a user-friendly notification system to keep users informed of important updates, events, and news within the platform",
      "Assisted in optimizing the website's performance and loading speed by employing best practices in web development, ensuring a smooth browsing experience across all devices",
      "Spearheaded the implementation of a responsive, mobile-first design, allowing users to access the platform with ease from various devices and screen sizes",
      "Worked closely with the design and backend development teams to ensure seamless coordination and timely completion of tasks, leading to the successful launch of several new features and improvements"
    ]
  }
]